---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElementIsCutting
source: html/057de773-88f6-c987-0a6d-b2eef3a1d807.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElementIsCutting Property

"Solid/Void"

## Syntax (C#)
```csharp
public static ForgeTypeId ElementIsCutting { get; }
```